hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/bootloader/ble_dfu/nrf_dfu_ble.c
    @param[inout] p_buffer  The buffer to encode into.
    @param[in]    op_code   The opcode of the response.
    @param[in]    result    The result of the operation.

    @return The length added to the buffer.
*/
static uint32_t response_prepare(uint8_t *p_buffer, uint8_t op_code, uint8_t result)
{
    ASSERT(p_buffer);
    p_buffer[0] = NRF_DFU_OP_RESPONSE;
    p_buffer[1] = op_code;
    p_buffer[2] = result;
    return RESPONSE_HEADER_LEN;
}


/** @brief Function for encoding a select object response into a buffer.

    The select object response consists of a maximum object size, a firmware offset, and a CRC value.

    @param[inout] p_buffer   The buffer to encode the response into.
    @param[in]    max_size   The maximum object size value to encode.
    @param[in]    fw_offset  The firmware offset value to encode.
    @param[in]    crc        The CRC value to encode.

    @return The length added to the buffer.
*/
static uint32_t response_select_obj_add(uint8_t   *p_buffer,
                                        uint32_t   max_size,
                                        uint32_t   fw_offset,
                                        uint32_t   crc)
{
    uint16_t offset = uint32_encode(max_size,  &p_buffer[RESPONSE_HEADER_LEN]);
    offset         += uint32_encode(fw_offset, &p_buffer[RESPONSE_HEADER_LEN + offset]);
    offset         += uint32_encode(crc,       &p_buffer[RESPONSE_HEADER_LEN + offset]);
    return offset;
}


/** @brief Function for encoding a CRC response into a buffer.

    The CRC response consists of a firmware offset and a CRC value.

    @param[inout] p_buffer   The buffer to encode the response into.
    @param[in]    fw_offset  The firmware offset value to encode.
    @param[in]    crc        The CRC value to encode.

    @return The length added to the buffer.
*/
static uint32_t response_crc_add(uint8_t *p_buffer, uint32_t fw_offset, uint32_t crc)
{
    uint16_t offset = uint32_encode(fw_offset, &p_buffer[RESPONSE_HEADER_LEN]);
    offset         += uint32_encode(crc,       &p_buffer[RESPONSE_HEADER_LEN + offset]);
    return offset;
}


/** @brief Function for appending an extended error code to the response buffer.

    @param[inout] p_buffer    The buffer to append the extended error code to.
    @param[in]    result      The error code to append.
    @param[in]    buf_offset  The current length of the buffer.

    @return The length added to the buffer.
*/
static uint32_t response_ext_err_payload_add(uint8_t *p_buffer, uint8_t result, uint32_t buf_offset)
{
    p_buffer[buf_offset] = ext_error_get();
    (void) ext_error_set(NRF_DFU_EXT_ERROR_NO_ERROR);
    return 1;
}


static void ble_dfu_req_handler_callback(nrf_dfu_response_t *p_res, void *p_context)
{
    ASSERT(p_res);
    ASSERT(p_context);
    
    uint8_t len = 0;
    uint8_t buffer[MAX_RESPONSE_LEN] = {0};
    
    if(p_res->request == NRF_DFU_OP_OBJECT_WRITE)
    {
        --m_pkt_notif_target_cnt;
        
        if((m_pkt_notif_target == 0) || (m_pkt_notif_target_cnt && m_pkt_notif_target > 0))
            return;
            
        /* Reply with a CRC message and reset the packet counter. */
        m_pkt_notif_target_cnt = m_pkt_notif_target;
        
        p_res->request = NRF_DFU_OP_CRC_GET;
    }
    
    len += response_prepare(buffer, p_res->request, p_res->result);
    
    if(p_res->result != NRF_DFU_RES_CODE_SUCCESS)
    {
        NRF_LOG_WARNING("DFU request %d failed with error: 0x%x", p_res->request, p_res->result);
        
        if(p_res->result == NRF_DFU_RES_CODE_EXT_ERROR)
            len += response_ext_err_payload_add(buffer, p_res->result, len);
            
        (void) response_send(buffer, len);
        return;
    }
    
    switch(p_res->request)
    {
        case NRF_DFU_OP_OBJECT_CREATE:
        case NRF_DFU_OP_OBJECT_EXECUTE:
            break;
            
        case NRF_DFU_OP_OBJECT_SELECT:
        {
            len += response_select_obj_add(buffer,
                                           p_res->select.max_size,
                                           p_res->select.offset,
                                           p_res->select.crc);
        }
        break;
        
        case NRF_DFU_OP_OBJECT_WRITE:
        {
            len += response_crc_add(buffer, p_res->write.offset, p_res->write.crc);
        }
        break;
        
        case NRF_DFU_OP_CRC_GET:
        {
            len += response_crc_add(buffer, p_res->crc.offset, p_res->crc.crc);
        }
        break;
        
        default:
        {
            // No action.
        } break;
    }
    
    (void) response_send(buffer, len);
}


/** @brief     Function for handling a Write event on the Control Point characteristic.

    @param[in] p_dfu             DFU Service Structure.
    @param[in] p_ble_write_evt   Pointer to the write event received from BLE stack.

    @return    NRF_SUCCESS on successful processing of control point write. Otherwise an error code.
*/
static uint32_t on_ctrl_pt_write(ble_dfu_t *p_dfu, ble_gatts_evt_write_t const *p_ble_write_evt)
{
    //lint -save -e415 -e416 : Out-of-bounds access on p_ble_write_evt->data
    nrf_dfu_request_t request =
    {
        .request           = (nrf_dfu_op_t)(p_ble_write_evt->data[0]),
        .p_context         = p_dfu,
        .callback.response = ble_dfu_req_handler_callback,
    };
    
    switch(request.request)
    {
        case NRF_DFU_OP_OBJECT_SELECT:
        {
            /* Set object type to read info about */
            request.select.object_type = p_ble_write_evt->data[1];
        }
        break;
        
        case NRF_DFU_OP_OBJECT_CREATE:
        {
            /* Activity on the current transport. Close all except the current one. */
            (void) nrf_dfu_transports_close(&ble_dfu_transport);
            
            /* Reset the packet receipt notification on create object */
            m_pkt_notif_target_cnt = m_pkt_notif_target;
            
            request.create.object_type = p_ble_write_evt->data[1];
            request.create.object_size = uint32_decode(&(p_ble_write_evt->data[2]));
        }
        break;
        
        case NRF_DFU_OP_RECEIPT_NOTIF_SET:
        {
            NRF_LOG_DEBUG("Set receipt notif");
            
            m_pkt_notif_target     = uint16_decode(&(p_ble_write_evt->data[1]));
            m_pkt_notif_target_cnt = m_pkt_notif_target;
        }
        break;
        
        default:
            break;
    }
    
