hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/bootloader/ble_dfu/nrf_dfu_ble.c
    //lint -restore : Out-of-bounds access
    
    return nrf_dfu_req_handler_on_req(&request);
}


/** @brief     Function for handling the @ref BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST event from the
              SoftDevice.

    @param[in] p_dfu     DFU Service Structure.
    @param[in] p_ble_evt Pointer to the event received from BLE stack.
*/
static bool on_rw_authorize_req(ble_dfu_t *p_dfu, ble_evt_t const *p_ble_evt)
{
    uint32_t err_code;
    
    ble_gatts_evt_rw_authorize_request_t const *p_authorize_request;
    ble_gatts_evt_write_t                const *p_ble_write_evt;
    
    p_authorize_request = &(p_ble_evt->evt.gatts_evt.params.authorize_request);
    p_ble_write_evt     = &(p_ble_evt->evt.gatts_evt.params.authorize_request.request.write);
    
    if((p_authorize_request->type                 != BLE_GATTS_AUTHORIZE_TYPE_WRITE)
       || (p_authorize_request->request.write.handle != p_dfu->dfu_ctrl_pt_handles.value_handle)
       || (p_authorize_request->request.write.op     != BLE_GATTS_OP_WRITE_REQ))
        return false;
        
    ble_gatts_rw_authorize_reply_params_t auth_reply =
    {
        .type                = BLE_GATTS_AUTHORIZE_TYPE_WRITE,
        .params.write.update = 1,
        .params.write.offset = p_ble_write_evt->offset,
        .params.write.len    = p_ble_write_evt->len,
        .params.write.p_data = p_ble_write_evt->data,
    };
    
    if(!is_cccd_configured(p_dfu))
    {
        /* Send an error response to the peer indicating that the CCCD is improperly configured. */
        auth_reply.params.write.gatt_status = BLE_GATT_STATUS_ATTERR_CPS_CCCD_CONFIG_ERROR;
        
        /* Ignore response of auth reply */
        (void) sd_ble_gatts_rw_authorize_reply(m_conn_handle, &auth_reply);
        return false;
    }
    
    else
    {
        auth_reply.params.write.gatt_status = BLE_GATT_STATUS_SUCCESS;
        
        err_code = sd_ble_gatts_rw_authorize_reply(m_conn_handle, &auth_reply);
        return err_code  == NRF_SUCCESS ? true : false;
    }
}


static void on_flash_write(void *p_buf)
{
    NRF_LOG_DEBUG("Freeing buffer %p", p_buf);
    nrf_balloc_free(&m_buffer_pool, p_buf);
}


/** @brief   Function for handling the @ref BLE_GATTS_EVT_WRITE event from the SoftDevice.

    @param[in] p_dfu     DFU Service Structure.
    @param[in] p_ble_evt Pointer to the event received from BLE stack.
*/
static void on_write(ble_dfu_t *p_dfu, ble_evt_t const *p_ble_evt)
{
    ble_gatts_evt_write_t const *const p_write_evt = &p_ble_evt->evt.gatts_evt.params.write;
    
    if(p_write_evt->handle != p_dfu->dfu_pkt_handles.value_handle)
        return;
        
    /* Allocate a buffer to receive data. */
    uint8_t *p_balloc_buf = nrf_balloc_alloc(&m_buffer_pool);
    
    if(p_balloc_buf == NULL)
    {
        /* Operations are retried by the host; do not give up here. */
        NRF_LOG_WARNING("cannot allocate memory buffer!");
        return;
    }
    
    NRF_LOG_DEBUG("Buffer %p acquired, len %d (%d)",
                  p_balloc_buf, p_write_evt->len, MAX_DFU_PKT_LEN);
                  
    /* Copy payload into buffer. */
    memcpy(p_balloc_buf, p_write_evt->data, p_write_evt->len);
    
    /* Set up the request. */
    nrf_dfu_request_t request =
    {
        .request      = NRF_DFU_OP_OBJECT_WRITE,
        .p_context    = p_dfu,
        .callback     =
        {
            .response = ble_dfu_req_handler_callback,
            .write    = on_flash_write,
        }
    };
    
    /* Set up the request buffer. */
    request.write.p_data   = p_balloc_buf;
    request.write.len      = p_write_evt->len;
    
    /* Schedule handling of the request. */
    ret_code_t rc = nrf_dfu_req_handler_on_req(&request);
    
    if(rc != NRF_SUCCESS)
    {
        /*  The error is logged in nrf_dfu_req_handler_on_req().
            Free the buffer.
        */
        (void) nrf_balloc_free(&m_buffer_pool, p_balloc_buf);
    }
}


/** @brief Function for the Application's SoftDevice event handler.

    @param[in] p_ble_evt SoftDevice event.
*/
static void ble_evt_handler(ble_evt_t const *p_ble_evt, void *p_context)
{
    uint32_t                    err_code;
    ble_gap_evt_t const *const p_gap = &p_ble_evt->evt.gap_evt;
    
    switch(p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
        {
            NRF_LOG_DEBUG("Connected");
            
            m_conn_handle = p_gap->conn_handle;
            
            if(m_observer)
                m_observer(NRF_DFU_EVT_TRANSPORT_ACTIVATED);
                
            err_code = sd_ble_gap_conn_param_update(m_conn_handle, &m_gap_conn_params);
            
            if(err_code != NRF_SUCCESS)
                NRF_LOG_ERROR("Failure to update connection parameters: 0x%x", err_code);
        }
        break;
        
        case BLE_GAP_EVT_DISCONNECTED:
        {
            m_conn_handle = BLE_CONN_HANDLE_INVALID;
            
            /* Restart advertising so that the DFU Controller can reconnect if possible. */
            if(!(m_flags & DFU_BLE_RESETTING_SOON))
            {
                err_code = advertising_start();
                APP_ERROR_CHECK(err_code);
            }
            
            if(m_observer)
                m_observer(NRF_DFU_EVT_TRANSPORT_DEACTIVATED);
        }
        break;
        
        case BLE_GATTS_EVT_WRITE:
        {
            on_write(&m_dfu, p_ble_evt);
        }
        break;
        
        case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST:
        {
            uint16_t const mtu_requested =
                p_ble_evt->evt.gatts_evt.params.exchange_mtu_request.client_rx_mtu;
                
            /*  If the requested MTU is smaller than the maximum, we can accept with the given
                stack configuration, and the payload is not word-aligned, reply with a smaller MTU
                that has a word-aligned payload. This ensures that the length of data we write to
                flash is a multiple of the word size.
            */
            uint16_t mtu_reply;
            
