hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/bootloader/ble_dfu/nrf_dfu_ble.c
            ble_gap_enc_info_t *p_enc_info = NULL;
            ble_gap_irk_t       *p_id_info  = NULL;
            
            #if (NRF_DFU_BLE_REQUIRES_BONDS)
            
            /* If there is a match in diversifier, then set the correct keys. */
            if(p_gap->params.sec_info_request.master_id.ediv ==
               m_peer_data.enc_key.master_id.ediv)
                p_enc_info = &m_peer_data.enc_key.enc_info;
                
            p_id_info = &m_peer_data.ble_id.id_info;
            #endif
            
            err_code = sd_ble_gap_sec_info_reply(p_gap->conn_handle, p_enc_info, p_id_info, NULL);
            APP_ERROR_CHECK(err_code);
        }
        break;
        
        case BLE_GAP_EVT_CONN_SEC_UPDATE:
        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
        {
            #if (NRF_DFU_BLE_REQUIRES_BONDS)
            err_code = service_changed_send();
            #else
            err_code = sd_ble_gatts_sys_attr_set(p_gap->conn_handle, NULL, 0, 0);
            #endif
            APP_ERROR_CHECK(err_code);
            NRF_LOG_DEBUG("Finished handling conn sec update");
        }
        break;
        
        default:
            /* No implementation needed. */
            break;
    }
}


#if (!NRF_DFU_BLE_REQUIRES_BONDS)
static uint32_t gap_address_change(void)
{
    uint32_t       err_code;
    ble_gap_addr_t addr;
    
    err_code = sd_ble_gap_addr_get(&addr);
    VERIFY_SUCCESS(err_code);
    
    /* Increase the BLE address by one when advertising openly. */
    addr.addr[0] += 1;
    
    err_code = sd_ble_gap_addr_set(&addr);
    VERIFY_SUCCESS(err_code);
    
    return NRF_SUCCESS;
}
#endif


/** @brief     Function for initializing GAP.

    @details   This function sets up all necessary GAP (Generic Access Profile) parameters of
              the device. It also sets the permissions and appearance.
*/
static uint32_t gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_sec_mode_t sec_mode;
    uint8_t const          *device_name;
    uint32_t                name_len;
    
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);
    
    #if (!NRF_DFU_BLE_REQUIRES_BONDS)
    
    err_code = gap_address_change();
    VERIFY_SUCCESS(err_code);
    
    if((m_flags & DFU_BLE_FLAG_USE_ADV_NAME) != 0)
    {
        NRF_LOG_DEBUG("Setting adv name: %s, length: %d", m_adv_name.name, m_adv_name.len);
        device_name = m_adv_name.name;
        name_len    = m_adv_name.len;
    }
    
    else
    #endif
    {
        NRF_LOG_DEBUG("Using default advertising name");
        device_name = (uint8_t const *)(NRF_DFU_BLE_ADV_NAME);
        name_len    = strlen(NRF_DFU_BLE_ADV_NAME);
    }
    
    err_code = sd_ble_gap_device_name_set(&sec_mode, device_name, name_len);
    VERIFY_SUCCESS(err_code);
    
    err_code = sd_ble_gap_ppcp_set(&m_gap_conn_params);
    return err_code;
}


static uint32_t ble_stack_init()
{
    ret_code_t err_code;
    uint32_t   ram_start = 0;
    
    /* Register as a BLE event observer to receive BLE events. */
    NRF_SDH_BLE_OBSERVER(m_ble_evt_observer, BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
    
    err_code = nrf_dfu_mbr_init_sd();
    VERIFY_SUCCESS(err_code);
    
    NRF_LOG_DEBUG("Setting up vector table: 0x%08x", BOOTLOADER_START_ADDR);
    err_code = sd_softdevice_vector_table_base_set(BOOTLOADER_START_ADDR);
    VERIFY_SUCCESS(err_code);
    
    NRF_LOG_DEBUG("Enabling SoftDevice.");
    err_code = nrf_sdh_enable_request();
    VERIFY_SUCCESS(err_code);
    
    /* Fetch the start address of the application RAM. */
    err_code = nrf_sdh_ble_app_ram_start_get(&ram_start);
    VERIFY_SUCCESS(err_code);
    
    NRF_LOG_DEBUG("Configuring BLE stack.");
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    VERIFY_SUCCESS(err_code);
    
    /* Enable the BLE stack. */
    NRF_LOG_DEBUG("Enabling the BLE stack.");
    return nrf_sdh_ble_enable(&ram_start);
}


/** @brief       Function for adding DFU Packet characteristic to the BLE Stack.

    @param[in]   p_dfu DFU Service structure.

    @return      NRF_SUCCESS on success. Otherwise an error code.
*/
static uint32_t dfu_pkt_char_add(ble_dfu_t *const p_dfu)
{
    ble_gatts_char_md_t char_md =
    {
        .char_props.write_wo_resp = 1,
    };
    
    ble_uuid_t char_uuid =
    {
        .type = p_dfu->uuid_type,
        .uuid = BLE_DFU_PKT_CHAR_UUID,
    };
    
    ble_gatts_attr_md_t attr_md =
    {
        .vloc = BLE_GATTS_VLOC_STACK,
        .vlen = 1,
        .write_perm =
        {
            .sm = 1,
            #if NRF_DFU_BLE_REQUIRES_BONDS
            .lv = 2,
            #else
            .lv = 1,
            #endif
        }
    };
    
    ble_gatts_attr_t attr_char_value =
    {
        .p_uuid    = &char_uuid,
        .p_attr_md = &attr_md,
        .max_len   = MAX_DFU_PKT_LEN,
    };
    
    return sd_ble_gatts_characteristic_add(p_dfu->service_handle,
                                           &char_md,
                                           &attr_char_value,
                                           &p_dfu->dfu_pkt_handles);
}


/** @brief       Function for adding DFU Control Point characteristic to the BLE Stack.

    @param[in]   p_dfu DFU Service structure.

    @return      NRF_SUCCESS on success. Otherwise an error code.
*/
static uint32_t dfu_ctrl_pt_add(ble_dfu_t *const p_dfu)
{
    ble_gatts_char_md_t char_md =
    {
        .char_props.write  = 1,
        .char_props.notify = 1,
    };
    
    ble_uuid_t char_uuid =
    {
        .type = p_dfu->uuid_type,
        .uuid = BLE_DFU_CTRL_PT_UUID,
    };
    
    ble_gatts_attr_md_t attr_md =
    {
        .vloc    = BLE_GATTS_VLOC_STACK,
        .wr_auth = 1,
        .vlen    = 1,
        .write_perm =
        {
            .sm = 1,
            #if NRF_DFU_BLE_REQUIRES_BONDS
            .lv = 2,
            #else
            .lv = 1,
            #endif
        },
    };
    
    ble_gatts_attr_t attr_char_value =
    {
        .p_uuid    = &char_uuid,
        .p_attr_md = &attr_md,
        .max_len   = BLE_GATT_ATT_MTU_DEFAULT,
    };
    
    return sd_ble_gatts_characteristic_add(p_dfu->service_handle,
                                           &char_md,
                                           &attr_char_value,
                                           &p_dfu->dfu_ctrl_pt_handles);
}


/** @brief     Function for checking if the CCCD of DFU Control point is configured for Notification.

    @details   This function checks if the CCCD of DFU Control Point characteristic is configured
              for Notification by the DFU Controller.

    @param[in] p_dfu DFU Service structure.

    @return    True if the CCCD of DFU Control Point characteristic is configured for Notification.
              False otherwise.
*/
uint32_t ble_dfu_init(ble_dfu_t *p_dfu)
{
    ASSERT(p_dfu != NULL);
    
    ble_uuid_t service_uuid;
    uint32_t   err_code;
    
    m_conn_handle = BLE_CONN_HANDLE_INVALID;
    
