hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/bootloader/ble_dfu/nrf_dfu_ble.c
    BLE_UUID_BLE_ASSIGN(service_uuid, BLE_DFU_SERVICE_UUID);
    
    err_code = sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY,
                                        &service_uuid,
                                        &(p_dfu->service_handle));
    VERIFY_SUCCESS(err_code);
    
    ble_uuid128_t const base_uuid128 =
    {
        {
            0x50, 0xEA, 0xDA, 0x30, 0x88, 0x83, 0xB8, 0x9F,
            0x60, 0x4F, 0x15, 0xF3,  0x00, 0x00, 0xC9, 0x8E
        }
    };
    
    err_code = sd_ble_uuid_vs_add(&base_uuid128, &p_dfu->uuid_type);
    VERIFY_SUCCESS(err_code);
    
    err_code = dfu_pkt_char_add(p_dfu);
    VERIFY_SUCCESS(err_code);
    
    err_code = dfu_ctrl_pt_add(p_dfu);
    VERIFY_SUCCESS(err_code);
    
    return NRF_SUCCESS;
}


static uint32_t ble_dfu_transport_init(nrf_dfu_observer_t observer)
{
    uint32_t err_code = NRF_SUCCESS;
    
    if(m_flags & DFU_BLE_FLAG_INITIALIZED)
        return err_code;
        
    NRF_LOG_DEBUG("Initializing BLE DFU transport");
    
    m_observer = observer;
    
    err_code = nrf_balloc_init(&m_buffer_pool);
    UNUSED_RETURN_VALUE(err_code);
    
    err_code = ble_stack_init();
    VERIFY_SUCCESS(err_code);
    
    #if (NRF_DFU_BLE_REQUIRES_BONDS)
    
    /* Copy out the peer data if bonds are required */
    if(nrf_dfu_settings_peer_data_is_valid())
    {
        NRF_LOG_DEBUG("Copying peer data");
        
        err_code = nrf_dfu_settings_peer_data_copy(&m_peer_data);
        UNUSED_RETURN_VALUE(err_code);
    }
    
    else
        APP_ERROR_HANDLER(NRF_ERROR_INTERNAL);
        
    #else
        
    /* Copy out the new advertisement name when bonds are not required and the name is set. */
    if(nrf_dfu_settings_adv_name_is_valid())
    {
        err_code = nrf_dfu_settings_adv_name_copy(&m_adv_name);
        UNUSED_RETURN_VALUE(err_code);
        
        /* Set flags for advertisement name that is to be used */
        m_flags |= DFU_BLE_FLAG_USE_ADV_NAME;
    }
        
    else
        NRF_LOG_DEBUG("No advertising name found");
        
    #endif
        
    err_code = gap_params_init();
    VERIFY_SUCCESS(err_code);
    
    /* Initialize the Device Firmware Update Service. */
    err_code = ble_dfu_init(&m_dfu);
    VERIFY_SUCCESS(err_code);
    
    err_code = advertising_start();
    VERIFY_SUCCESS(err_code);
    
    m_flags |= DFU_BLE_FLAG_INITIALIZED;
    
    NRF_LOG_DEBUG("BLE DFU transport initialized.");
    
    return NRF_SUCCESS;
}


static uint32_t ble_dfu_transport_close(nrf_dfu_transport_t const *p_exception)
{
    uint32_t err_code = NRF_SUCCESS;
    
    if((m_flags & DFU_BLE_FLAG_INITIALIZED) && (p_exception != &ble_dfu_transport))
    {
        NRF_LOG_DEBUG("Shutting down BLE transport.");
        
        if(m_conn_handle != BLE_CONN_HANDLE_INVALID)
        {
            NRF_LOG_DEBUG("Disconnecting.");
            
            /* Set flag to prevent advertisement from starting */
            m_flags |= DFU_BLE_RESETTING_SOON;
            
            /* Disconnect from the peer. */
            err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            VERIFY_SUCCESS(err_code);
            
            /* Wait a bit for the disconnect event to be sent on air. */
            nrf_delay_ms(200);
        }
        
        else
        {
            err_code = sd_ble_gap_adv_stop(m_adv_handle);
            UNUSED_RETURN_VALUE(err_code);
        }
        
        err_code = nrf_sdh_disable_request();
        
        if(err_code == NRF_SUCCESS)
            NRF_LOG_DEBUG("BLE transport shut down.");
    }
    
    return err_code;
}
